''' Множество (set) неупорядоченный набор уникальных объектов '''
''' (любые неизменяемые типы данных) '''
# ls = [22, 22, 22, 33, 44]
# st = set(ls)
# print(st)
# st.clear() # пустое множество
# st = {22, 33, 44}
# print(st)
#
# st.add(100) # добавление в множестве через add а не как в списках через append
# st.update({2, 3})
# n = st.pop() #  удаление первое в множестве
# st.remove(3) # удаление конкретного значения в множестве, но если этого элемента нет, будет "ошибка"
# st.discard(2) # удаление конкретного значения в ножестве и не вызывает ошибку!!
# print(st)

# st1 = {3, 4, 33}
# st2 = {3, 4, 44}
# res = st1.union(st2) # объединение множеств
# res = st1 | st2 # альтернатива предыдущей команды для объединения множеств
# print(res)
#
# # res = st1.intersection(st2) # пересечение множеств
# res = st1 & st2 # альтернатива пересечения множеств
# print(res)

# res = st1.difference(st2)  # вычитание множеств
# res = st2 - st1 # альтернатива вычитания множеств
# print(res)

# res = st1.symmetric_difference(st2) # симметрическое вычетание множества (удаляет одинаковые значения и оставляет разные)
# res = st1 ^ st2 # альтернатива симметрического вычетания
# print(res)

# st3 = {3, 4}
# print(st3.issubset(st2))
# print(st1.issuperset(st3))

