'''dict
неупорядоченный набор пар ключ:значение в которых ключ уникален
'''

# d = {}
#
# d = {'Pb': 'свинец', 'Au': 'Золото'}
# print(d['Pb'])
# print(d.get('Pb1')) # при поиске несуществующего ключа - не выдает ошибку, пишет 'None'
# print(d.get('Pb1', 'Не найдено!'))
#
# d['Pb'] = 'Свинец' # присваивает другое значение по ключу в словаре(было "свинец, стало "Свинец")
# print(d)

'''Методы добавления'''
# d['Fe'] = 'Железо'  # если в словаре небыло этого значения, оно не заменяется, а добавляется
# print(d)
# d.setdefault(1, 1000)  # добавляет новое значение, не меняет старые
# print(d)
# d.update({3: 33, 1: 11}) # 3 вариант добавления значений в словарь с обновлением данных
# print(d)

'''Методы удаления'''
# n = d.pop('Fe')
# nn = d.popitem() # удаляет последнее добавленное значение
# print(n, nn)
# d.clear() # чистит весь словарь
# print(d)

# print(len(d)) # показывает колличество пар
# print(d.keys()) # показывает только ключи
# for i in d: # 2 вариант просмотра ключей
#     print(i)
# print(list(d)) # 3 вариант просмотра ключей

# print(list(d.values())) # показывает только значение
# for v in d.values():
#     print(v) # 2 вариант просмотра значений

# print(list(d.items())) # получение списка кортежа из словаря
# for k, v in d.items():
#     print(k, v)

'''Создание словаря dict'''
# lst = [('Pb', 'свинец'), ('Au', 'Золото'), ('Fe', 'Железо'), (1, 11), (3, 33)]
# dd = dict(lst)
# print(dd)
# lst = [11, 22, 33]
# dd = dict.fromkeys(lst, 100)
# print(dd)
#
# dd = {i: i**2 for i in range(10, 20)}
# print(dd)

# dd = {}
# for i in range(10, 20):
#     dd[i] = i**2
# print(dd)
